# 2.	Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.

number = float(input("Введите число "))

print(int(number * 10) % 10)



# # var2

# number = input("Введите число ").split(".")

# print(number[1][0])
